snlkuharlocal/src/DataProcessors/ВыгрузкаВоФранчБазу/ВыгрузкаВоФранчБазу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаВоФранчБазу</name>
  <attributes>
    <name>Дата1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаОбмена</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПолучатель</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикДляПеремещений</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентЭквайринг</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбДок</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенЧЛ</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Очередь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>фНоменклатура_Номра</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фНоменклатура_Группа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фНоменклатура_Харка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фВводОстатковТМЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фИНВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фОКС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фОПР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фПНК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фПНК_ВЗВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фПрайсЛист</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фПРМ_ПНК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фПРМ_ПРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фПРМ_РНК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фПС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фРНК_ПНК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фСПН</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фЧекККМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фРКО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фПКО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаБитыхСсылок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>фУстановкаСкидок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбВидОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксРазмерВыборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>фПерезаписыватьРеквизитыСправочников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фПерезаписыватьДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фСоздаватьОбъектыПоСсылкам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_Сеанса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаСверок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаданияОбмена</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Направление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Начало</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Конец</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнформацияОбОшибке</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъектыОбмена</name>
    <attributes>
      <name>ОбъектТип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектСсылкаУИД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтборРС_Хэш</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ссылка</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Ошибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗаписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантВыгрузки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаписей</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КривыеОбъекты</name>
    <attributes>
      <name>ОбъектСсылка</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектТип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/ФР_ОбъектыКВыгрузке/ФР_ОбъектыКВыгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФР_ОбъектыКВыгрузке</name>
  <resources>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборРС</name>
    <comment>Отбор регистра сведений</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаПриВыгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектТип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектСсылкаУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтборРС_Хэш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВариантВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИД_Пакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/РеквизитыСправочников/РеквизитыСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыСправочников</name>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Справочник</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/КоличествоПосетителей/КоличествоПосетителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КоличествоПосетителей</name>
  <resources>
    <name>КоличествоПосетителей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПосетителейЧЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/История/История.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>История</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>CatalogRef.Декларация</types>
      <types>CatalogRef.Подразделения</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.Контрагенты</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.ПунктыДоставки</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Договоры</types>
      <types>CatalogRef.ТНВЭД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ВводОстатковТМЦ</types>
      <types>DocumentRef.Декларация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Переоценка</types>
      <types>DocumentRef.Машина</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/DataProcessors/ВыгрузкаВоФранчБазу/Forms/ФормаТонкая/Module.bsl
#Область СобытияФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	Терминал1_ХТМЛ=ПолучитьТестМакета("ХТМЛ_ОкноТерминала");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтборДокументов();
КонецПроцедуры


#КонецОбласти 

&НаСервере
Процедура УстановитьОтборДокументов()
	
	СВ_ПодразделениеРНК 	= ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00295");
	СВ_СкладПолРНК			= ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00296");	
	СВ_ОрганизацияКонтр 	= ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00297");
	
	СписокПНК.Параметры.УстановитьЗначениеПараметра("СВ_СкладПолРНК", 		СВ_СкладПолРНК);
	СписокПНК.Параметры.УстановитьЗначениеПараметра("СВ_ОрганизацияКонтр", 	СВ_ОрганизацияКонтр);
	
	//Документы	
	СписокИНВ.Параметры.УстановитьЗначениеПараметра("Подразделение", 		Объект.ПодразделениеПолучатель);
	СписокОКС.Параметры.УстановитьЗначениеПараметра("Подразделение", 		Объект.ПодразделениеПолучатель);
	СписокОПР.Параметры.УстановитьЗначениеПараметра("Подразделение", 		Объект.ПодразделениеПолучатель);
	СписокСПН.Параметры.УстановитьЗначениеПараметра("Подразделение", 		Объект.ПодразделениеПолучатель);
	СписокПНК.Параметры.УстановитьЗначениеПараметра("Подразделение", 		Объект.ПодразделениеПолучатель);
	СписокПНК_ВЗВ.Параметры.УстановитьЗначениеПараметра("Подразделение", 	Объект.ПодразделениеПолучатель);
    СписокПРМ.Параметры.УстановитьЗначениеПараметра("Подразделение", 		Объект.ПодразделениеПолучатель);	
	СписокПРМ_ВЗВ.Параметры.УстановитьЗначениеПараметра("Подразделение", 	Объект.ПодразделениеПолучатель);	
	СписокРНК.Параметры.УстановитьЗначениеПараметра("Подразделение", 		Объект.ПодразделениеПолучатель);
	СписокПРЛ.Параметры.УстановитьЗначениеПараметра("Подразделение", 		Объект.ПодразделениеПолучатель);
	СписокУСК.Параметры.УстановитьЗначениеПараметра("Подразделение", 		Объект.ПодразделениеПолучатель);
	СписокЭПС.Параметры.УстановитьЗначениеПараметра("Подразделение", 		Объект.ПодразделениеПолучатель);
	СписокВВодОст.Параметры.УстановитьЗначениеПараметра("Подразделение", 	Объект.ПодразделениеПолучатель);
	
	//Справочники
	СписокКасс.Параметры.УстановитьЗначениеПараметра("Подразделение", Объект.ПодразделениеПолучатель);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПНК_ПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("СостояниеНакладной");	
	
	СписокНакладных_ПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки, МассивРеквизитов);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПРМ_ПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("СостояниеНакладной");
	
	СписокНакладных_ПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки, МассивРеквизитов);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокНакладных_ПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки, МассивРеквизитов) Экспорт
	
	ВыделяемыеЦветомСостояния = Новый Массив;
	ВыделяемыеЦветомСостояния.Добавить(Перечисления.СостоянияНакладной.Отгружена);
	ВыделяемыеЦветомСостояния.Добавить(Перечисления.СостоянияНакладной.Принята);
	
	Для Каждого СтрокаДинСписка Из Строки Цикл
		
		Для Каждого ИмяРеквизита Из МассивРеквизитов Цикл
			
			ДанныеСтроки		= СтрокаДинСписка.Значение.Данные;
			ОформлениеСтроки	= СтрокаДинСписка.Значение.Оформление;
			
			ТекСостояние	= ДанныеСтроки[ИмяРеквизита];			
			ОформлениеПоля	= ОформлениеСтроки[ИмяРеквизита];
			
			УстановитьПараметрОформленияПоля(ОформлениеПоля, "Текст", ФР_ОбщегоНазначения_ПИ.БукваСостоянияНакладной_(ТекСостояние));
			
			Если ВыделяемыеЦветомСостояния.Найти(ТекСостояние) <> Неопределено Тогда
				УстановитьПараметрОформленияПоля(ОформлениеПоля, "ЦветФона", WebЦвета.СветлоЗеленый);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПараметрОформленияПоля(ОформлениеПоля, ПараметрОформления, Значение)
	ЭлементОформления = ОформлениеПоля.Элементы.Найти(ПараметрОформления);
	Если ЭлементОформления <> Неопределено Тогда
		ЭлементОформления.Значение = Значение;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ЗарегистрироватьНоменклатуруПоНакладнымНаСервере(МассивСсылок)	
	ОбработкаОбъект	= РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ЗарегистрироватьНоменклатуруПоНакладным(МассивСсылок);
КонецФункции

&НаКлиенте
Процедура ЗарегистрироватьНоменклатуруПоНакладным(Команда)	
	Результат	= ЗарегистрироватьНоменклатуруПоНакладнымНаСервере(ПолучитьСсылкиНаНакладные());	
	Для Каждого Стр Из Результат.Сообщения Цикл
		Сообщить(Стр);		
	КонецЦикла; 
КонецПроцедуры
 
&НаКлиенте
Процедура ЗарегистрироватьДекларацииПоНакладным(Команда)	
	Результат	= ЗарегистрироватьДекларацииПоНакладнымНаСервере(ПолучитьСсылкиНаНакладные());	
	Для Каждого Стр Из Результат.Сообщения Цикл
		Сообщить(Стр);		
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьШКПоНакладным(Команда)	
	Результат	= ЗарегистрироватьШКПоНакладнымНаСервере(ПолучитьСсылкиНаНакладные());	
	Для Каждого Стр Из Результат.Сообщения Цикл
		Сообщить(Стр);		
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСсылкиНаНакладные()
	МассивСсылок	= Новый Массив;
	
	Если ЭтаФорма.ТекущийЭлемент=Элементы.СписокПНК Тогда
		ТекСписок	= Элементы.СписокПНК;		
	ИначеЕсли ЭтаФорма.ТекущийЭлемент=Элементы.СписокПРМ Тогда			
		ТекСписок	= Элементы.СписокПРМ;
	Иначе
		Возврат МассивСсылок;
	КонецЕсли; 
	
	
	Для Каждого Строка Из ТекСписок.ВыделенныеСтроки Цикл
		МассивСсылок.Добавить(Строка);	
	КонецЦикла;

	Возврат МассивСсылок;
КонецФункции // ()

&НаСервере
Функция ЗарегистрироватьДекларацииПоНакладнымНаСервере(МассивСсылок)		
	ОбработкаОбъект	= РеквизитФормыВЗначение("Объект");	
	Возврат ОбработкаОбъект.ЗарегистрироватьДекларацииПоНакладным(МассивСсылок);	
КонецФункции

&НаСервере
Функция ЗарегистрироватьШКПоНакладнымНаСервере(МассивСсылок)	
	ОбработкаОбъект	= РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ЗарегистрироватьШКПоНакладным(МассивСсылок);
КонецФункции


&НаКлиенте
Процедура ОткрытьОбъектыКВыгрузке(Команда)
	ОткрытьФорму("РегистрСведений.ФР_ОбъектыКВыгрузке.ФормаСписка",,ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура ПодразделениеПолучатель_ПриИзменении(Элемент)
	
	УстановитьОтборДокументов();   

КонецПроцедуры




&НаСервере
Функция ПолучитьТестМакета(ИмяМакета)
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьМакет(ИмяМакета).ПолучитьТекст();
КонецФункции // ()

&НаКлиенте
Функция ВывестиВТерминал(Текст,Знач Цвет="black",Тэг="div")	
	Элементы.Терминал1_ХТМЛ.Документ.defaultView.write_mes(СтрШаблон("<%3 style='color: %2'>%1</%3>",Текст,Цвет,Тэг));
КонецФункции //ВывестиВТерминал(Текст)

&НаКлиенте
Процедура ПроверитьДанныеНовогоМагазина(Команда)	
	Сообщения	= ПроверитьДанныеНовогоМагазинаНаСервере();
	Для Каждого Сообщение Из Сообщения Цикл
	    ВывестиВТерминал(Сообщение.ТекстСообщения,Сообщение.Цвет);
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ПроверитьДанныеНовогоМагазинаНаСервере()	
	Сообщения		= Новый Массив;
	Подразделение	= Объект.ПодразделениеПолучатель;
	Если Подразделение.Пустая() Тогда			
		Сообщения.Добавить(СоздатьСообщение("Не указано подразделение нового магазина !","red",Истина));		
	КонецЕсли; 	
	
	Возврат Сообщения;
КонецФункции

&НаСервере
Функция СоздатьСообщение(ТекстСообщения,Цвет,Ошибка)
	Возврат Новый Структура("ТекстСообщения,Цвет,Ошибка",ТекстСообщения,Цвет,Ошибка);	
КонецФункции // ()

&НаСервереБезКонтекста
Процедура ЗарегистрироватьДокументыНаСервере(МассивСсылок)	
	ТО	= РегистрыСведений.ФР_ОбъектыКВыгрузке.СоздатьТаблицуОБъектов();
	
	Для Каждого Ссылка Из МассивСсылок Цикл
		ОТ	= ФР_ОбщегоНазначения_ПИ.ОписаниеТипа(ЗначениеВСтрокуВнутр(ТипЗнч(Ссылка)));
		
		СтрокаТО				= ТО.Добавить();	
		СтрокаТО.ОбъектТип		= ОТ.ПолноеИмя;
		СтрокаТО.ОбъектСсылка   = Ссылка;
		//СтрокаТО.Получатель = ;		
		
		Если ТипЗнч(Ссылка)=Тип("ДокументСсылка.ПрайсЛист") Тогда			
			РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьЦены(Ссылка);
		ИначеЕсли ТипЗнч(Ссылка)=Тип("ДокументСсылка.УстановкаСкидок") Тогда
			РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьСкидки(Ссылка);
		КонецЕсли; 
		
	КонецЦикла; 
	
	ДопПараметры	= Новый Структура("РегистрироватьДопОбъекты",Ложь);
	РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъекты(ТО,ДопПараметры);	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьДокументы(Команда)
	МассивСсылок	= Новый Массив;
	Если ТипЗнч(ЭтаФорма.ТекущийЭлемент)=Тип("ТаблицаФормы") Тогда		
		Для Каждого Элемент Из ЭтаФорма.ТекущийЭлемент.ВыделенныеСтроки Цикл	
			МассивСсылок.Добавить(Элемент);
		КонецЦикла; 
		ЗарегистрироватьДокументыНаСервере(МассивСсылок);	
	КонецЕсли; 
	
	ВывестиВТерминал("Зарегистрировано: "+МассивСсылок.Количество(),"green");
КонецПроцедуры
 
&НаКлиенте
Процедура ЗарегистрироватьПодчиненныеСправочники(Команда)
	
	МассивСсылок	= ЗарегистрироватьПодчиненныеСправочникиНаСервере(Объект.ПодразделениеПолучатель);
	
	СсылкиПотипам	= РассортироватьСсылкиПоТипам(МассивСсылок);
	Для Каждого Элемент Из СсылкиПотипам Цикл
		МассивСсылок	= Элемент.Значение;		
		ВывестиВТерминал(СтрШаблон("Зарегистрировано к выгрузке. Получатель: %1, объект: %2, кол-во: %3.",Объект.ПодразделениеПолучатель,Элемент.Ключ,МассивСсылок.Количество()),"green");
	КонецЦикла; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗарегистрироватьПодчиненныеСправочникиНаСервере(Подразделение)
	Запрос	= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц;
	Запрос.Текст="	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Ссылка
	|ПОМЕСТИТЬ ВТ_РНК
	|ИЗ
	|	Документ.РасходнаяНакладная КАК Накладные
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.РеквизитыСправочников КАК Реквизиты
	|ПО 
	|	Накладные.ПунктДоставки = Реквизиты.Справочник
	|	И Реквизиты.ИмяРеквизита = ""ПодразделениеФранчайзинга""
	|	И Реквизиты.ЗначениеРеквизита = &Подразделение
	|;	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Автор КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Ссылки
	|ИЗ
	|	Документ.ОтчетКассовойСмены
	|ГДЕ
	|	Подразделение=&Подразделение
	|	И Проведен
	|	И НЕ Автор.ВерсияДанных ЕСТЬ NULL
	|ОБЪЕДИНИТЬ	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Ссылка
	|ИЗ
	|	Справочник.ФизическиеЛица
	|ГДЕ
	|	Подразделение	= &Подразделение
	|	И НЕ ПометкаУдаления
	|	И НЕ ЭтоГруппа
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ
	|	&Подразделение
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Ссылка
	|ИЗ
	|	Справочник.Кассы
	|ГДЕ
	|	Владелец=&Подразделение	
	|	И НЕ ПометкаУдаления
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	СкладПолучатель КАК Ссылка
	|ИЗ
	|	Документ.Перемещение
	|ГДЕ
	|	СкладПолучатель.Подразделение	= &Подразделение	
	|	И Проведен
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Склад КАК Ссылка
	|ИЗ
	|	Документ.Перемещение
	|ГДЕ
	|	СкладПолучатель.Подразделение	= &Подразделение	
	|	И Проведен
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Организация КАК Ссылка
	|ИЗ
	|	Справочник.Склады
	|ГДЕ
	|	Подразделение=&Подразделение	
	|	И НЕ ПометкаУдаления
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Ссылка.Контрагент КАК Ссылка
	|ИЗ
	|	ВТ_РНК	
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Ссылка.Договор КАК Ссылка
	|ИЗ
	|	ВТ_РНК
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Ссылка.Менеджер КАК Ссылка
	|ИЗ
	|	ВТ_РНК	
	|ОБЪЕДИНИТЬ	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Продавец КАК Ссылка
	|ИЗ
	|	Документ.ОтчетКассовойСмены.Товары
	|ГДЕ
	|	Ссылка.Подразделение=&Подразделение
	|	И Ссылка.Проведен
	|	И НЕ Менеджер.ВерсияДанных ЕСТЬ NULL
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Склад КАК Ссылка
	|ИЗ
	|	Документ.ОтчетКассовойСмены
	|ГДЕ
	|	Подразделение=&Подразделение
	|	И Проведен
	|	И НЕ Склад.ВерсияДанных ЕСТЬ NULL
	|;
	|ВЫБРАТЬ 
	|	Ссылка 
	|ИЗ 
	|	ВТ_Ссылки
	|";
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение);	
	
	РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьВыборку(Запрос,"");
	
	Запрос.Текст="ВЫБРАТЬ Ссылка ИЗ ВТ_Ссылки";	
	
	МС	= Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Для Каждого Ссылка Из МС Цикл
		ТипСсылки = ТипЗнч(Ссылка);
		Если ТипСсылки = Тип("СправочникСсылка.Договоры") Тогда
			РегистрыСведений.ФР_ОбъектыКВыгрузке.СделатьЗаписьРегистрации(Ссылка,"Элемент");
		ИначеЕсли ТипСсылки = Тип("СправочникСсылка.Контрагенты") Тогда
			РегистрыСведений.ФР_ОбъектыКВыгрузке.СделатьЗаписьРегистрации(Ссылка,"Элемент");
		КонецЕсли; 	
	КонецЦикла; 
	
	
	Возврат МС;	
КонецФункции 

&НаСервере
Функция РассортироватьСсылкиПоТипам(МассивСсылок)
	СсылкиПоТипам	= Новый Соответствие;
	
	Для Каждого Ссылка Из МассивСсылок Цикл
		Если ЗначениеЗаполнено(Ссылка) Тогда		
			ОТ		= ФР_ОбщегоНазначения_ПИ.ОписаниеТипа(ЗначениеВСтрокуВнутр(ТипЗнч(Ссылка)));		
			Если ЗначениеЗаполнено(ОТ.ПолноеИмя) Тогда
				Ссылки	= СсылкиПоТипам.Получить(ОТ.ПолноеИмя);
				Если Ссылки=Неопределено Тогда
					Ссылки=Новый Массив;				
				КонецЕсли; 
				Ссылки.Добавить(Ссылка);
				СсылкиПоТипам.Вставить(ОТ.ПолноеИмя,Ссылки);			
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат СсылкиПоТипам;	
КонецФункции // ()

&НаСервере
Процедура ЗарегистрироватьКоличествоПосетителейНаСервере()
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Дата,
	|	Подразделение
	|ИЗ
	|	РегистрСведений.КоличествоПосетителей
	|ГДЕ
	|	Подразделение = &ПодразделениеПолучатель
	|	И Дата МЕЖДУ &Дата1 И &Дата2 
	|";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Объект.Дата1));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.Дата2));
	
	Запрос.УстановитьПараметр("ПодразделениеПолучатель",Объект.ПодразделениеПолучатель);	
	
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НЗ	= РегистрыСведений.КоличествоПосетителей.СоздатьНаборЗаписей();
		НЗ.Отбор.Подразделение.Установить(Выборка.Подразделение,Истина);
		НЗ.Отбор.Дата.Установить(Выборка.Дата,Истина);
		
		РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъект(НЗ);	
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьКоличествоПосетителей(Команда)
	ЗарегистрироватьКоличествоПосетителейНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоказатьИнфоОБитыхСсылкахНаСервере()	
	ОбработатьБитыеСсылки("Инфо");	
КонецПроцедуры

&НаСервере
Процедура ОбработатьБитыеСсылки(Режим)
	ТО	= ПолучитьТаблицуБитыхСсылок(СписокБитыхСсылок);
		
	Если Режим="Выгрузить" Тогда
		ОбработкаОбъект	= РеквизитФормыВЗначение("Объект");
		
		ДопПараметры	= Новый Структура("СписокОбъектов",ТО);
		Результат		= ОбработкаОбъект.ВыгрузитьПакетом("Файл",ДопПараметры);
		
		Сообщить(Результат.ВыгруженоОбъектов);		
	ИначеЕсли Режим="Инфо" Тогда
		ТекстОперации="Получена инфа";		
		КривыеОбъекты.Очистить();
		Для Каждого СтрокаТО Из ТО Цикл
			СтрокаКО				= КривыеОбъекты.Добавить();		
			СтрокаКО.ОбъектСсылка	= СтрокаТО.ОбъектСсылка;		
			СтрокаКО.ОбъектТип  	= СтрокаТО.ОбъектТип
		КонецЦикла;
	ИначеЕсли  Режим="ПоказатьАртикулы" Тогда
		Для Каждого СтрокаТО Из ТО Цикл
			Сообщить(СтрШаблон("%1,%2,%3",СтрокаТО.ОбъектТип,СтрокаТО.ОбъектСсылка.УникальныйИдентификатор(),СтрокаТО.ОбъектСсылка.КодПроизводителя));
		КонецЦикла				
	Иначе
		РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъекты(ТО);		
	КонецЕсли;		
	
	Если Режим<>"Инфо" Тогда
		ТО.Свернуть("ОбъектТип","Количество");
		ТО.Сортировать("ОбъектТип");
		Для Каждого СтрокаТО Из ТО Цикл
			Сообщить(?(Режим="Выгрузить","Выгружено","Зарегистрировано")+": "+СтрокаТО.ОбъектТип+" : "+СтрокаТО.Количество+" об.");	
		КонецЦикла;	
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьШКпоХарактеристикам(Команда)
	Кол	= ЗарегистрироватьШКпоХарактеристикамНаСервере();
	Сообщить(СтрШаблон("Зарегистрировано к выгрузке: %1 ШК.",Кол));
КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьШКпоХарактеристикамНаСервере()
	ТО	= ПолучитьТаблицуБитыхСсылок(СписокБитыхСсылок);
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Ссылка
  	|ИЗ
	|	Справочник.ШтрихКоды	
	|ГДЕ	
	|	Владелец В (&МассивНоменклатуры)	
	|	И ТипШК	= ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	|	И НЕ Наименование ПОДОБНО ""9999%""
	|УПОРЯДОЧИТЬ ПО 	
	|	Наименование
	|";	
	
	Результат = РеквизитФормыВЗначение("Объект").ЗарегистрироватьВыборку(Запрос.Текст,"Справочник.ШтрихКоды","Элемент",Новый Структура("МассивНоменклатуры",ТО.ВыгрузитьКолонку("ОбъектСсылка")));
	
	Возврат Результат.Зарегистрировано;
КонецФункции


&НаСервере
Функция ПолучитьТаблицуБитыхСсылок(СтрокаБС)	
	ОбработкаОбъект	= РеквизитФормыВЗначение("Объект");
	
	Текст=Новый ТекстовыйДокумент;
	Текст.УстановитьТекст(СтрокаБС);
	
	ТО	= РегистрыСведений.ФР_ОбъектыКВыгрузке.СоздатьТаблицуОбъектов();	
	ТО.Колонки.Добавить("Количество",ПолучитьОписаниеТиповЧисла(10));
	
	ВыгруженныеОбъекты	= Новый Соответствие;
	
	Всего	=   Текст.КоличествоСтрок();
	Для Сч=1 По Текст.КоличествоСтрок() Цикл		
		ДанныеСтроки	= ФР_ОбщегоНазначения_КС.СтрокуВСтруктуру(Текст.ПолучитьСтроку(Сч),"ПолноеИмяТипа,ТекстСсылки");
		
		ПолноеИмяТипа	= ДанныеСтроки.ПолноеИмяТипа;
		ТекстСсылки		= СокрЛП(ДанныеСтроки.ТекстСсылки);
		
		Менеджер	  	= ОбработкаОбъект.ПолучитьМенеджер(ПолноеИмяТипа);
		
		Если СтрДлина(ТекстСсылки)>12 Тогда
			Ссылка	= Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(ТекстСсылки));
		Иначе
			Ссылка	= Менеджер.НайтиПоКоду(ТекстСсылки);	
		КонецЕсли;		
		
		ПолноеИмяТипаТек	= ОбработкаОбъект.ПолучитьПолноеИмяТипаТек(ПолноеИмяТипа);
		Если НЕ Ссылка.Пустая() И ОбработкаОбъект.ОбъектСуществует(Ссылка,ПолноеИмяТипаТек) Тогда			
			СтрокаТО					= ТО.Добавить();
			
			СтрокаТО.ОбъектТип			= ПолноеИмяТипаТек;
			СтрокаТО.ОбъектСсылка		= Ссылка;			
			СтрокаТО.ВариантВыгрузки	= РегистрыСведений.ФР_ОбъектыКВыгрузке.ВариантВыгрузки(Ссылка);
			СтрокаТО.Количество			= 1;
		Иначе
			Сообщить("Не найден объект: '"+ПолноеИмяТипаТек+"' по ссылке: """+ТекстСсылки+""".",СтатусСообщения.Важное);
		КонецЕсли;
		Всего=Всего-1;
		Если Всего%100=0 Тогда
			 //Состояние("Разбор данных о ссылках. Осталось: "+Всего+" строк.");
		КонецЕсли; 
	КонецЦикла;

	//Состояние("");
	
	Возврат ТО;
КонецФункции //ПолучитьТаблицуБитыхСсылок(СтрокаБС)

&НаСервере
Функция ТЗвМассивСтруктур(ТЗ)
	Колонки	= Новый Массив;
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		Колонки.Добавить(Колонка.Имя);	
	КонецЦикла; 
	
	СтрокаКолонок	= СтрСоединить(Колонки,",");
	
	Результат	= Новый Массив;
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		ДанныеСтроки	= Новый Структура(СтрокаКолонок);	
		ЗаполнитьЗначенияСвойств(ДанныеСтроки,СтрокаТЗ);
		
		Результат.Добавить(ДанныеСтроки);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции //ТЗвМассивСтруктур(ТЗ)
 

&НаКлиенте
Процедура ПоказатьИнфоОБитыхСсылках(Команда)
	ПоказатьИнфоОБитыхСсылкахНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗрегистрироватьНоменклатуруСИерархиейНаСервере()
	ТО		= ПолучитьТаблицуБитыхСсылок(СписокБитыхСсылок);
	
	Запрос	= Новый Запрос;
	
	Запрос.Текст="ВЫБРАТЬ Ссылка ИЗ Справочник.Номенклатура ГДЕ Ссылка В (&МС) ИТОГИ ПО Ссылка ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("МС",	ТО.ВыгрузитьКолонку("ОбъектСсылка"));
	
	ТО	= РегистрыСведений.ФР_ОбъектыКВыгрузке.СоздатьТаблицуОбъектов();
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		СтрокаТО 				= ТО.Добавить();
		СтрокаТО.ОбъектСсылка	= Выборка.Ссылка;		
	КонецЦикла; 
	
	РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъекты(ТО);	
	Сообщить("Зарегистрировано: "+ТО.Количество());	

КонецПроцедуры

&НаКлиенте
Процедура ЗрегистрироватьНоменклатуруСИерархией(Команда)
	ЗрегистрироватьНоменклатуруСИерархиейНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗрегистрироватьСсылкиНаСервере()
	ОбработатьБитыеСсылки("Зарегистрировать");
КонецПроцедуры

&НаКлиенте
Процедура ЗрегистрироватьСсылки(Команда)
	ЗрегистрироватьСсылкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьЦеныПоставщика(Команда)
	ЗарегистрироватьЦеныПоставщикаНаСервере(Объект.ПодразделениеПолучатель);
КонецПроцедуры

Функция ЗарегистрироватьЦеныПоставщикаНаСервере(Подразделение)
	ОбработкаОбъект	= РеквизитФормыВЗначение("Объект");
	
	Запрос	= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц;
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Ссылка
	|ПОМЕСТИТЬ ВТ_РНК
	|ИЗ
	|	Документ.РасходнаяНакладная КАК Накладные
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.РеквизитыСправочников КАК Реквизиты
	|ПО 
	|	Накладные.ПунктДоставки = Реквизиты.Справочник
	|	И Реквизиты.ИмяРеквизита = ""ПодразделениеФранчайзинга""
	|	И Реквизиты.ЗначениеРеквизита = &Подразделение
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Ссылка.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ВТ_Контрагенты
	|ИЗ
	|	ВТ_РНК	
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	ТипЦен 
	|ПОМЕСТИТЬ ВТ_ТипыЦен
	|ИЗ 
	|	Справочник.Контрагенты.Скидки 
	|ГДЕ 
	|	Ссылка В (ВЫБРАТЬ Контрагент ИЗ ВТ_Контрагенты)
	|;	
	|ВЫБРАТЬ Контрагент ИЗ ВТ_Контрагенты
	|";
	
	Запрос.УстановитьПараметр("Подразделение",	Подразделение);		
	Запрос.УстановитьПараметр("Дата1",			НачалоДня(Объект.Дата1));
	
	ТО	= РегистрыСведений.ФР_ОбъектыКВыгрузке.СоздатьТаблицуОбъектов();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТО 					= ТО.Добавить();
		
		СтрокаТО.ОбъектТип 			= "Справочник.Контрагенты";
		СтрокаТО.ОбъектСсылка		= Выборка.Контрагент;
		СтрокаТО.ВариантВыгрузки	= "Документ.ЦеныПоставщика";
	КонецЦикла;
	
	Запрос.Текст="ВЫБРАТЬ ТипЦен ИЗ ВТ_ТипыЦен";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТО 					= ТО.Добавить();
		
		СтрокаТО.ОбъектТип 			= "Справочник.ТипыЦен";
		СтрокаТО.ОбъектСсылка		= Выборка.ТипЦен;
		СтрокаТО.ВариантВыгрузки	= "Элемент";
	КонецЦикла;	
	
	Запрос.Текст = "
	|ВЫБРАТЬ 
	|	Ссылка КАК Прайс,
	|	Ссылка.ТипЦен КАК ТипЦен
	|ИЗ
	|	Документ.ПрайсЛист
	|ГДЕ
	|	Дата2 >= &Дата1
	|	И Проведен
	|	И ТипЦен В (ВЫБРАТЬ ТипЦен ИЗ ВТ_ТипыЦен)
	|";	
	
	Если ЗначениеЗаполнено(Объект.Дата1) Тогда
		Выборка	= Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаТО 					= ТО.Добавить();
		
			СтрокаТО.ОбъектТип 			= "Документ.ПрайсЛист";
			СтрокаТО.ОбъектСсылка		= Выборка.Прайс;			
			
			//Процедура ЗаполнитьСтрокуРегистрации_РС(СтрокаТО,Вид,Отбор) Экспорт
			
			СтрокаТО 					= ТО.Добавить();
		
			СтрокаТО.ОбъектТип 			= "Документ.ПрайсЛист";
			СтрокаТО.ОбъектСсылка		= Выборка.Прайс;		
			
			Отбор=Новый Структура("Прайс,ТипЦен");
			ЗаполнитьЗначенияСвойств(Отбор,Выборка);
			ОбработкаОбъект.ЗаполнитьСтрокуРегистрации_РС(СтрокаТО,"ЦеныНоменклатуры",Отбор);			
		КонецЦикла;	
	КонецЕсли;
	
	РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъекты(ТО);		
	
КонецФункции

&НаСервере
Функция ВыгрузитьОстаткиНаСервере()
	Возврат РеквизитФормыВЗначение("Объект").ВыгрузитьОстатки();
КонецФункции

&НаКлиенте
Процедура ВыгрузитьОстатки(Команда)	
	Если ЗначениеЗаполнено(Объект.ИмяФайлаСверок) Тогда
		СтрДанных = ВыгрузитьОстаткиНаСервере();
		
		Текст	= Новый ЗаписьТекста;
		
		Текст.Открыть(Объект.ИмяФайлаСверок);
		Текст.ЗаписатьСтроку(СтрДанных);
		Текст.Закрыть();	
	Иначе
		ПоказатьПредупреждение(,"Не указан файл выгрузки остатков.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаСверок_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ФР_РаботаСДиалогами.ЧудесатыйВыборФайла(ЭтаФорма, Элемент, "dat", "Файл данных (*.dat)|*.dat", РежимДиалогаВыбораФайла.Сохранение);	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаОбмена_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ФР_РаботаСДиалогами.ЧудесатыйВыборФайла(ЭтаФорма, Элемент, "xml","Файл xml (*.xml)|*.xml", РежимДиалогаВыбораФайла.Открытие);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьСсылки_СтандартныйФормат(Команда)
	
	ИмяФайла = ВыбратьФайл();
	Если ПустаяСтрока(ИмяФайла) Тогда Возврат КонецЕсли; 
	
	МассивСсылок = ПолучитьТаблицуБитыхСсылок(СписокБитыхСсылок).ВыгрузитьКолонку("ОбъектСсылка");
	
	//СтрокаXML = ПолучитьСтрокуXML(ПараметрКоманды);
	Результат	= ВыгрузитьВXML(МассивСсылок);
	Ошибки		= Результат.Ошибки;
	Если Ошибки.Количество()=0 Тогда
		СтрокаXML	= ПолучитьИзВременногоХранилища(Результат.Адрес);
		
		ЗаписатьСтрокуВФайл(СтрокаXML, ИмяФайла);	
		
		ПоказатьОповещениеПользователя("Выгрузка в файл XML завершена.", , , БиблиотекаКартинок.ЗакончитьРедактирование, СтатусОповещенияПользователя.Важное);  
	Иначе
		ПоказатьПредупреждение(,СтрШаблон("Ошибка выгрузки в файл XML !%1%2",Символы.ПС,СтрСоединить(Ошибки,Символы.ПС)));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ВыбратьФайл()
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = "Выберите файл для сохранения";
	Диалог.ПолноеИмяФайла = "";
	Диалог.ПредварительныйПросмотр = Ложь;
	Диалог.Фильтр = "Файлы XML (*.xml)|*.xml";
	
	мИмяФайла = "";	
	Если Диалог.Выбрать() Тогда
		мИмяФайла = Диалог.ПолноеИмяФайла;	
	КонецЕсли;	
	
	Возврат мИмяФайла;
КонецФункции //ВыбратьФайл()

&НаКлиенте
Процедура ЗаписатьСтрокуВФайл(Строка, ИмяФайла)
	ЗаписьТекста = Новый ЗаписьТекста;
	ЗаписьТекста.Открыть(ИмяФайла);
	ЗаписьТекста.Записать(Строка);
	ЗаписьТекста.Закрыть();
КонецПроцедуры 
 

&НаСервере
Функция ВыгрузитьВXML(МассивСсылок)			
	Результат	= Новый Структура("Адрес,Ошибки",Неопределено,Новый Массив);
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();		
				
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("_1CV8DtUD", "http://www.1c.ru/V8/1CV8DtUD/");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("V8Exch", "http://www.1c.ru/V8/1CV8DtUD/");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8",  "http://v8.1c.ru/data");
	ЗаписьXML.ЗаписатьНачалоЭлемента("V8Exch:Data");
	
	Для Каждого Ссылка Из МассивСсылок Цикл	
		ЗаписатьXML(ЗаписьXML,Ссылка.ПолучитьОбъект());			
	КонецЦикла;
		
	ЗаписьXML.ЗаписатьКонецЭлемента(); //V8Exc:Data
	ЗаписьXML.ЗаписатьКонецЭлемента(); //V8Exc:_1CV8DtUD	
	
	СтрДанных		= ЗаписьXML.Закрыть();
	Результат.Адрес	= ПоместитьВоВременноеХранилище(СтрДанных);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьСсылки(Элемент)
	ИмяФайла = ВыбратьФайл();
	Если ПустаяСтрока(ИмяФайла) Тогда Возврат КонецЕсли;
	
	ТО 			= ПолучитьТаблицуБитыхСсылок(СписокБитыхСсылок);
	Результат 	= ВыгрузитьСсылкиНаСервере(ТО.ВыгрузитьКолонку("ОбъектСсылка"));
	
	ЗаписатьСтрокуВФайл(Результат.Данные, ИмяФайла);	
	
	ПоказатьОповещениеПользователя("Сохранен файл",,ИмяФайла,,СтатусОповещенияПользователя.Информация);
КонецПроцедуры

&НаСервере
Функция ВыгрузитьСсылкиНаСервере(МассивСсылок)
	
	СписокОбъектов	= Новый Массив;
	Для Каждого Ссылка Из МассивСсылок Цикл		
		Если РегистрыСведений.ФР_ОбъектыКВыгрузке.НужноРегистрироватьОбъект(Ссылка).Нужно Тогда
			СписокОбъектов.Добавить(Ссылка);	
		КонецЕсли; 
	КонецЦикла;	
	
	ОбрОбъект 		= РеквизитФормыВЗначение("Объект");
	ОбрОбъект.ИмяФайлаОбмена	= "";
	ОбрОбъект.УзелПолучатель	= ПланыОбмена.ФР_ОбменСФРК.НайтиПоКоду("CO_FR");
	
	ДопПараметры	= Новый Структура("СписокОбъектов", СписокОбъектов);
	
	Результат		= РеквизитФормыВЗначение("Объект").ВыгрузитьПакетом("Файл", ДопПараметры);
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ЗарегитьДекларацииПоМодели(Элемент)
	
	Зарегистрировть_рсИстория_ДекларацииПоМодели_НаСервере();
	
КонецПроцедуры

&НаСервере
Процедура Зарегистрировть_рсИстория_ДекларацииПоМодели_НаСервере()
	ТабСсылки	= ПолучитьТаблицуБитыхСсылок(СписокБитыхСсылок);
	
	Запрос = Новый Запрос;
	Запрос.Текст	= "	
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Ссылки ИЗ &ТабСсылки КАК ТабСсылки
	|;	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъектСсылка КАК Модель	
	|ПОМЕСТИТЬ
	|	ВТ_Номенклатура
	|ИЗ
	|	ВТ_Ссылки
	|ГДЕ
	|	ОбъектСсылка ССЫЛКА Справочник.Номенклатура 
	|;
	|ВЫБРАТЬ 	
	|	История.Объект			КАК Объект,
	|	История.Реквизит		КАК Реквизит,
	|	История.Значение		КАК Значение,
	|	История.Документ		КАК Документ,
	|	ПоследниеПериоды.Период	КАК Период	
	|ИЗ
	|	РегистрСведений.История	КАК История
	|ПРАВОЕ СОЕДИНЕНИЕ	
	|(
	|ВЫБРАТЬ
	|	Объект 				КАК Номенклатура,
	|	Реквизит			КАК Реквизит,
	|	МАКСИМУМ(Период)	КАК Период
	|ИЗ
	|	РегистрСведений.История
	|ГДЕ 	
	|	Объект ССЫЛКА Справочник.Номенклатура
	|	И Реквизит = ""Декларация""
	|	И НЕ ВЫРАЗИТЬ(Объект КАК Справочник.Номенклатура).ВерсияДанных ЕСТЬ NULL
	|	И Объект В (ВЫБРАТЬ РАЗЛИЧНЫЕ Модель ИЗ ВТ_Номенклатура)
	|СГРУППИРОВАТЬ ПО
	|	Объект,
	|	Реквизит
	|) КАК ПоследниеПериоды
	|ПО
	|	История.Период = ПоследниеПериоды.Период
	|	И История.Объект ССЫЛКА Справочник.Номенклатура
	|	И История.Объект	= ПоследниеПериоды.Номенклатура
	|	И История.Реквизит	= ПоследниеПериоды.Реквизит	
	|УПОРЯДОЧИТЬ ПО Объект
	|";
	
	
	Запрос.УстановитьПараметр("ТабСсылки", ТабСсылки);
	
	ТО			= РегистрыСведений.ФР_ОбъектыКВыгрузке.СоздатьТаблицуОбъектов();
	
	Результат	= Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	
	Сч=Выборка.Количество();
	
	Пока Выборка.Следующий() Цикл
		//ОбработкаПрерыванияПользователя();
		
		НЗ	= РегистрыСведений.История.СоздатьНаборЗаписей();
		
		НЗ.Отбор.Период.Установить(Выборка.Период,Истина);	
		НЗ.Отбор.Объект.Установить(Выборка.Объект,Истина);
		НЗ.Отбор.Реквизит.Установить(Выборка.Реквизит,Истина);
		НЗ.Отбор.Документ.Установить(Выборка.Документ,Истина);
		
		СтрокаТО	= ТО.Добавить();
		
		СтрокаТО.ОбъектСсылка		= Выборка.Объект;		
		СтрокаТО.ВариантВыгрузки	= "РегистрСведений.История";
		СтрокаТО.ОтборРС			= Новый ХранилищеЗначения(ЗначениеВСтрокуВнутр(НЗ.Отбор));		
		СтрокаТО.ОтборРС_Хэш		= ФР_ОбщегоНазначения_С.ХэшСтрока(СтрокаТО.ОтборРС);	
		
		СтрокаТО	= ТО.Добавить();		
		СтрокаТО.ОбъектСсылка		= Выборка.Значение;
		
		Сч=Сч-1;
		Если Сч%100=0 Тогда
			//Состояние(Сч);		
		КонецЕсли; 
	КонецЦикла; 
			
	РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъекты(ТО);	
	Сообщить("Зарегистрировано: "+ТО.Количество());
КонецПроцедуры
